# AnalyticalModelSupport Properties (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
AnalyticalModelSupport Properties
AnalyticalModelSupport Class See Also
---
The AnalyticalModelSupport type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
AnalyticalModelSupport Class
Autodesk.Revit.DB.Structure Namespace